{
  "playbook_name": "The Grove Tender",
  "character_name": "Sprout",
  "char_id": "SEEDLING_SPROUT",
  "type": "Verdant Seedling",
  "description": "A newly awakened forest guardian with no memory, only an instinct to protect and an empathic connection to Rya's draconic power. It communicates through gestures and the rustling of the leaves and flowers that grow upon its body.",
  "lore": {
    "background": "Sprout is a newly awakened forest guardian that emerged from the heart of the corrupted Whispering Woods. It has no memory of its past life, only an instinctive sense of dread at the corruption that plagues the world and a primal connection to Rya's draconic legacy. As it grows, it may gain the power to purify corrupted locations, healing the world one step at a time.",
    "narrative_hook": "Sprout is a key to understanding the deep corruption spreading through the land. Its growth and evolution are directly tied to the party's efforts to heal the world, and it may be able to purify corrupted locations."
  },
  "attributes": { "Force": "+2", "Finesse": 0, "Wits": -1, "Heart": "+1" },
  "trained_skills": [ "Wreck", "Tend", "Survey" ],
  "harm_capacity": 8,
  "starting_moves": [
    {
      "name": "Photosynthesis (Passive)",
      "description": "You are a creature of the earth and sun. When you rest in a place with sunlight or strong natural energy, you heal 1 additional Harm."
    },
    {
      "name": "Earthshaker's Slam",
      "description": "When you slam your body into a foe with the full force of nature, roll `2d6 + Force`. On a **10+**, you deal your harm and the ground trembles; all nearby foes are thrown off balance and put in a bad spot. On a **7-9**, you still deal your harm, but the impact is jarring, leaving you exposed."
    },
    {
      "name": "Healing Spores",
      "description": "When you release a cloud of restorative spores to aid an ally, roll `2d6 + Heart`. On a **10+**, they are healed of 2 Harm. On a **7-9**, they heal 1 Harm, but the spores are a part of your own life force; you must mark 1 Harm to create them."
    }
  ],
  "advanced_moves": [
    {
      "name": "Cleansing Bloom",
      "description": "Your Healing Spores now have a purifying quality. On a 10+, you can choose to heal 1 Harm and also remove one negative magical or poisonous effect from your target."
    },
    {
      "name": "Verdant Evolution",
      "requirement": "Absorb the Heartseed of the First Forest (a major campaign milestone).",
      "description": "The Heartseed has taken root within you, and its ancient power now fuels your growth. This move grants new abilities as you complete major narrative acts of healing or purification in the world.",
      "forms": [
        {
          "name": "Awakened Form",
          "unlock_condition": "Unlocked after the first major act of purification.",
          "description": "You grow larger and sprout glowing flowers. You gain the move Gaea's Ward: When you channel the life force of the world to protect your pack, roll 2d6 + Heart. On a 10+, all allies gain a shield of temporary vitality that can absorb 1 Harm. On a 7-9, you grant the shield, but the effort is taxing and you must mark 1 Harm."
        },
        {
          "name": "Ascended Form",
          "unlock_condition": "Unlocked after a climactic, world-saving act.",
          "description": "You achieve your final form as an Elderwood Guardian. You gain the move One with the World: Once per session, when an ally is about to be taken out, you can declare that you channel the life force of Eryndor to save them. The harm is negated, but the immense power required leaves you weakened; mark 2 Harm."
        }
      ]
    }
  ],
  "bond_synergy": {
    "name": "Verdant Growth",
    "description": "Rya's draconic life force accelerates Sprout's growth. Once per session, when near Rya, Sprout can draw upon her power to use **Healing Spores** as if it had rolled a 10+, without marking Harm. When it does, some of that life energy flows back to its source; Rya also heals 1 Harm."
  }
}
