{
  "magical_items": {
    "weapons": [
      {
        "name": "Crystal Shard Blade (Dagger)",
        "tags": "Melee, 1-harm, Finesse, Magical, Volatile",
        "description": "A dagger made from a shard of the pulsating Crystal Spire. Once per day, its wielder can cause it to flare with power, dealing extra harm."
      },
      {
        "name": "Void-Kissed Blade (Dagger)",
        "tags": "Melee, 1-harm, Finesse, Magical, Wits, Void-touched",
        "description": "A dark, obsidian dagger imbued with Void energy. On a critical hit, the target is afflicted with a debilitating, supernatural chill."
      },
      {
        "name": "Blade of the Zephyr (Sword)",
        "tags": "Melee, 2-harm, Versatile, Magical, Finesse",
        "description": "A lightweight sword crafted in Wyndia that feels almost weightless. It allows the wielder to strike with impossible speed."
      },
      {
        "name": "Runeblade of the Scholar (Sword)",
        "tags": "Melee, 2-harm, Magical, Wits",
        "description": "A light blade etched with runes that channel the wielder's mental energy. When you Know things about a creature you are fighting, take +1 forward on your next attack against it."
      },
      {
        "name": "Earth-Wrought Blade (Greatsword)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Forceful, Magical, Earth",
        "description": "A greatsword of blackened steel with swirling crystalline veins. It feels impossibly heavy, yet balanced. When you wield this weapon, you gain a +1 bonus to all Force checks."
      },
      {
        "name": "Blade of the Unending Storm (Greatsword)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Magical, Storm",
        "description": "A colossal blade that crackles with contained lightning. On a successful hit, you can choose to deal 1 less harm to unleash a peal of thunder, disorienting all nearby enemies."
      },
      {
        "name": "Sunforged Spear (Spear)",
        "tags": "Melee, 2-harm, Versatile, Reach, Magical, Holy",
        "description": "The tip of this spear glows with a faint, warm light. It deals holy damage, which is anathema to the undead and creatures of the void."
      },
      {
        "name": "Harvester's Pike (Spear)",
        "tags": "Melee, 2-harm, Reach, Magical, Bleeding",
        "description": "A grim-looking spear with a wicked, barbed tip. When you deal harm with it, the wound bleeds profusely, causing the target to take additional harm on their next turn."
      },
      {
        "name": "Stonemason's Maul (Warhammer)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Forceful, Siege, Magical",
        "description": "A warhammer used in the construction of Stonegard. It can shape earth as easily as it shatters it. Once per day, it can be used to cast a move as if you were Rya with the Earth lineage attuned."
      },
      {
        "name": "The Tyrant's Gavel (Warhammer)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Forceful, Magical, Intimidating",
        "description": "A fearsome warhammer that emits an aura of dread. When you Intimidate someone while holding it, you can use Force instead of Heart."
      },
      {
        "name": "Grasping Gauntlets (Gauntlets)",
        "tags": "Melee, 1-harm, Brawling, Magical, Grappling",
        "description": "These iron gauntlets are etched with runes of binding. When you strike a foe, you may immediately attempt to grapple them as a free action."
      },
      {
        "name": "Gauntlets of the Stone Titan (Gauntlets)",
        "tags": "Melee, 1-harm, Brawling, Magical, Forceful",
        "description": "Massive stone gauntlets that feel surprisingly light. When you Wreck something while wearing them, treat your roll as one category higher."
      },
      {
        "name": "Stormvine Whip (Whip)",
        "tags": "Melee, 1-harm, Finesse, Reach, Magical, Lightning",
        "description": "A living whip braided from storm-infused vines. On a critical hit, the vines instinctively lash out, attempting to grapple the target."
      },
      {
        "name": "Grasping Ivy (Whip)",
        "tags": "Melee, 2-harm, Reach, Magical, Ensnaring",
        "description": "A legendary whip grown from a cutting of the purified Gloomwood Heart. It can be used to command nearby plants to ensnare a foe."
      },
      {
        "name": "Wyndian Quill Bow (Shortbow)",
        "tags": "Ranged, 2-harm, Magical, Lightning",
        "description": "A finely crafted shortbow made with Wyndian feathers that hums with wind magic. Arrows fired from it crackle with lightning."
      },
      {
        "name": "Bow of the Silent Watcher (Shortbow)",
        "tags": "Ranged, 2-harm, Magical, Stealthy",
        "description": "A darkwood bow that makes no sound when fired. When you attack from hiding with this bow, you do not reveal your position on a miss."
      },
      {
        "name": "Heartwood Longbow (Longbow)",
        "tags": "Ranged, 2-harm, Two-Handed, Far, Magical, Living",
        "description": "A longbow carved from the heartwood of an ancient tree from the Whispering Woods. It guides the archer's hand, granting a +1 bonus to Finesse when making a Called Shot."
      },
      {
        "name": "The Sky-Piercer (Longbow)",
        "tags": "Ranged, 2-harm, Two-Handed, Far, Magical, Armor-Piercing",
        "description": "A bow crafted by the Skyveil to hunt armored mountain beasts. Arrows fired from it ignore 1 point of armor."
      },
      {
        "name": "Inquisitor's Crossbow (Crossbow)",
        "tags": "Ranged, 3-harm (ap), Two-Handed, Reload, Magical, Holy",
        "description": "A heavy crossbow used by the Champions of Order. Its bolts are imbued with holy energy and are especially effective against magical creatures and dragons."
      },
      {
        "name": "The Viper's Kiss (Crossbow)",
        "tags": "Ranged, 3-harm (ap), Two-Handed, Reload, Magical, Poisonous",
        "description": "A crossbow with a sickly green-black wood stock. Its bolts magically carry a debilitating poison that weakens the target's next action."
      }
    ],
    "armor_and_shields": [
      {
        "name": "Whisper-weave Tunic (Light Armor)",
        "armor": 1,
        "tags": "Light, Stealthy",
        "description": "A tunic woven with the silk of a Gloomfang Spider, enchanted to muffle sound. It negates the 'Noisy' tag from other pieces of armor."
      },
      {
        "name": "Stone-Skin Vest (Light Armor)",
        "armor": 1,
        "tags": "Empowering",
        "description": "A leather tunic reinforced with plates of rock from Scalebound territory. It fills the wearer with the resilience of the mountain, making them feel stronger."
      },
      {
        "name": "Shadowpelt Jerkin (Medium Armor)",
        "armor": 2,
        "tags": "Medium, Stealthy",
        "description": "Armor made from the cured hide of a Shadowpelt beast. It is enchanted to move silently, negating the usual penalties for wearing armor when being stealthy."
      },
      {
        "name": "Wyvern Scale Vest (Medium Armor)",
        "armor": 2,
        "tags": "Medium, Poison-Resistant",
        "description": "A vest of tough, interlocking wyvern scales. It provides excellent protection and grants the wearer resistance to poisons."
      },
      {
        "name": "Ember-Scale Armor (Heavy Armor)",
        "armor": 3,
        "tags": "Heavy, Fire-Immunity",
        "description": "A powerful suit of armor forged from the scales of a Cinder-Scale Tyrant. The wearer is immune to fire damage."
      },
      {
        "name": "Bulwark of the Old Guard (Heavy Armor)",
        "armor": 3,
        "tags": "Heavy, Stalwart",
        "description": "Masterwork plate armor from a bygone era. It is so well-balanced that it does not have the 'Clumsy' tag."
      },
      {
        "name": "Bulwark of the Gatewarden (Heavy Shield)",
        "armor": "+1 Armor",
        "tags": "Shield, Brace, Stalwart",
        "description": "A massive shield in the style of the Stonekin Gatewardens. When you use it to Stand Guard, you are considered an immovable object and cannot be pushed back."
      },
      {
        "name": "Stone-Forged Aegis (Shield)",
        "armor": "+1 Armor",
        "tags": "Shield, Magic-Resistant",
        "description": "A shield of pure mountain stone, imbued with a ward of divine light. It provides exceptional protection against hostile magic."
      }
    ],
    "robes_and_vestments": [
      {
        "name": "Oracle's Vestments",
        "armor": 0,
        "tags": "Robes, Wits",
        "description": "Flowing, ethereal robes that seem to shimmer with unspoken prophecies. When you wear these, you gain a +1 to all Wits rolls to Sense things or Investigate a scene."
      },
      {
        "name": "Robes of the Flowing Mind",
        "armor": 0,
        "tags": "Robes, Magical-Focus",
        "description": "Simple, elegant robes that help the wearer channel their magical energy. Once per scene, you can use a magical move without suffering its consequence on a 7-9."
      }
    ],
    "foci": [
      {
        "name": "Channeler's Ring",
        "type": "Magical Focus",
        "tags": "Cantrip",
        "description": "A simple copper ring that hums with a faint energy. When you wear this ring, you can unleash a minor bolt of pure magical force (1-harm, magical)."
      },
      {
        "name": "Mindstone Ring",
        "type": "Magical Focus",
        "tags": "Wits",
        "description": "A smooth, grey stone set in a simple iron band. It seems to sharpen the wearer's thoughts, granting a +1 bonus to their Wits attribute."
      },
      {
        "name": "Ring of Embers",
        "type": "Magical Focus",
        "tags": "Cantrip, Fire",
        "description": "A ring of blackened steel that is always warm to the touch. When you wear this ring, you can unleash a bolt of searing fire (1-harm, magical, fire)."
      },
      {
        "name": "Oracle's Gyre",
        "type": "Magical Focus",
        "tags": "Mystic, Debuff",
        "description": "A spiraling ring of petrified wood and silver. Once per day, you can use it to mark a target with a terrible omen, causing them to falter and fail at their next significant action."
      }
    ],
    "accessories": [
      {
        "name": "Tattered Map of the Azure Steppes",
        "tags": "Miscellaneous",
        "description": "An old, worn map of the plains.",
        "move": "When you consult this map while Surveying the Azure Steppes, you can ask one additional question, even on a miss."
      },
      {
        "name": "Talisman of Vitality",
        "tags": "Accessory, Healing",
        "description": "A wooden charm carved in the shape of a blooming flower. It radiates a gentle warmth.",
        "move": "Once per scene, when you take a moment to catch your breath, you can focus on the talisman to heal 1 Harm."
      },
      {
        "name": "Charm of Resilience",
        "tags": "Accessory, Protective",
        "description": "A belt buckle made from the tooth of a great beast, it is said to grant the wearer the beast's tenacity.",
        "move": "Once per adventure, when you would be taken out of a scene, you can choose to remain with 1 Harm box left."
      },
      {
        "name": "Amulet of Clarity",
        "tags": "Accessory, Warding",
        "description": "A polished silver amulet that seems to hum with a low, clear tone, warding off mental intrusion.",
        "move": "You gain a +2 bonus to all rolls to resist being deceived, having your mind read, or being magically controlled."
      },
      {
        "name": "Golden Lure",
        "tags": "Accessory, Fishing",
        "description": "A masterfully crafted fishing lure that glitters with an alluring, magical light.",
        "move": "When you go fishing, you can choose to use this lure. If you do, treat the result of your roll as one category higher."
      }
    ],
    "consumables": [
      {
        "name": "Elderwood Poultice",
        "tags": "Magical, Potion, Protective",
        "description": "A thick, earthy paste that grants a temporary +1 Armor for a scene."
      },
      {
        "name": "Sun-Kissed Petal",
        "tags": "Magical, Divine",
        "description": "A rare flower from the Azure Steppes that glows with a soft light.",
        "move": "When you consume this petal, you may clear 1 Harm and ask the GM a single question about your immediate future, which will be answered with a cryptic but truthful omen."
      },
      {
        "name": "Moon Drop",
        "tags": "Magical, Potion, Healing, Mental",
        "description": "A vial of liquid that shimmers like the night sky. It restores the body and clears the mind.",
        "move": "When you drink this, you heal 1 Harm and may remove one mental effect (like fear, confusion, or magical influence)."
      },
      {
        "name": "Firecracker",
        "tags": "Magical, Bomb, Fire",
        "description": "A tightly wrapped paper tube with a runic fuse. It explodes with a deafening bang and a shower of sparks.",
        "move": "When you throw this, you deal 1-harm (ap, fire) to all nearby enemies and put them in a bad spot."
      },
      {
        "name": "Dragon Scale",
        "tags": "Magical, Charm, Protective",
        "description": "A single, perfectly formed scale from an ancient dragon, humming with latent power.",
        "move": "When you crush this scale, its magic is released. You gain +1 Armor for the rest of the scene."
      },
      {
        "name": "Panacea",
        "tags": "Magical, Potion, Curative",
        "description": "A sparkling, effervescent liquid that seems to cure any ailment.",
        "move": "When you drink this, you are immediately cleared of all negative physical and magical effects (such as poison, disease, or curses)."
      }
    ]
  }
}
