{
  "magical_items": {
    "weapons": [
      {
        "name": "Whisperfang Daggers (Dagger)",
        "tags": "Melee, 1-harm, Finesse, Magical, Silencing",
        "description": "A pair of daggers forged with void-touched metal. When they strike true, they seem to steal the sound from their victim's throat."
      },
      {
        "name": "Sunstone Blade (Sword)",
        "tags": "Melee, 2-harm, Versatile, Magical, Holy, Blinding",
        "description": "A blade forged with a sunstone core. Once per scene, its wielder can command it to unleash a blinding flash of light, disorienting a foe."
      },
      {
        "name": "Dragon's Tooth (Greatsword)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Magical, Draconic",
        "description": "A colossal blade carved from the tooth of an ancient dragon. It resonates with Rya's power, dealing extra harm of her currently attuned element."
      },
      {
        "name": "Piercing Gale (Spear)",
        "tags": "Melee, 2-harm, Reach, Magical, Finesse, Armor-Piercing",
        "description": "A lightweight spear with a tip of enchanted, hardened air. It ignores 1 point of the target's armor."
      },
      {
        "name": "Golem-Wrecker (Warhammer)",
        "tags": "Melee, 3-harm (ap), Two-Handed, Siege, Magical",
        "description": "A hammer inscribed with runes of unmaking. It is brutally effective against constructs, dealing +2 harm to them."
      },
      {
        "name": "Soulstring Bow (Longbow)",
        "tags": "Ranged, 2-harm, Far, Magical, Wits",
        "description": "A bow strung with a strand of a wraith's essence. Its arrows seem to have a will of their own, guided by the wielder's intellect to seek their target's life force."
      }
    ],
    "armor_and_shields": [
      {
        "name": "Mirage Mail (Medium Armor)",
        "armor": 2,
        "tags": "Medium, Magical, Illusory",
        "description": "A suit of shimmering chainmail that bends the light around it. Once per scene, when you take harm, you can create a perfect illusory duplicate of yourself to confuse your enemies."
      },
      {
        "name": "Aegis of the Stalwart (Heavy Shield)",
        "armor": "+1 Armor",
        "tags": "Shield, Magical, Protective",
        "description": "A heavy shield that can absorb a single, devastating blow. Once per adventure, you can declare that an attack against you deals no harm."
      }
    ],
    "robes_and_vestments": [
      {
        "name": "Flowing Robes of the Tide",
        "armor": 0,
        "tags": "Robes, Healing, Magical",
        "description": "Robes that seem to be woven from living water. Once per scene, you can take a moment to focus and clear 1 Harm."
      },
      {
        "name": "Mantle of the Pack Leader",
        "armor": 0,
        "tags": "Robes, Heart, Commanding",
        "description": "The ceremonial cloak of a Frostfang alpha. When you give an inspiring command to your allies, you can use your Heart attribute to also give them +1 Armor for the next exchange."
      }
    ],
    "accessories": [
      {
        "name": "Ring of the Earth-Warden",
        "tags": "Accessory, Magical, Force",
        "description": "A thick iron ring that feels as heavy as a stone. It grants the wearer a +1 bonus to their Force attribute (max +3)."
      },
      {
        "name": "Pendant of the Red Sun",
        "tags": "Accessory, Magical, Warding",
        "description": "A warm, crimson stone that provides protection from extreme heat. You are resistant to fire damage, taking 1 less harm from fire sources."
      },
      {
        "name": "Boots of the Unseen Path",
        "tags": "Accessory, Magical, Stealthy",
        "description": "Soft leather boots that are always silent, no matter the surface. When you Prowl, you leave no tracks, magical or otherwise."
      }
    ],
    "consumables": [
      {
        "name": "Elixir of Might",
        "tags": "Magical, Potion, Buff",
        "description": "A thick, crimson liquid that temporarily enhances physical power.",
        "move": "When you drink this, your muscles surge with power. For the rest of the scene, your attacks deal +1 harm."
      },
      {
        "name": "Draught of Haste",
        "tags": "Magical, Potion, Buff",
        "description": "A shimmering, silver liquid that seems to vibrate with energy.",
        "move": "When you drink this, you are filled with impossible speed. You may immediately take an extra action."
      },
      {
        "name": "Ghost Pepper",
        "tags": "Magical, Food, Fire",
        "description": "A small, pale white pepper that is shockingly spicy. A favorite of the Brood of Dragnor.",
        "move": "When you eat this, your mouth is filled with magical fire. For the next few moments, you can breathe a short cone of flame that deals 1-harm (fire)."
      },
      {
        "name": "Stone-Skin Potion",
        "tags": "Magical, Potion, Protective",
        "description": "A gritty, gray liquid that hardens the skin.",
        "move": "When you drink this, your skin takes on a stone-like quality. You gain +1 Armor for the rest of the scene."
      }
    ]
  }
}
