{
  "bestiary": {
    "tier_6_10": [
      {
        "name": "Banshee",
        "description": "The sorrowful spirit of a woman whose shriek can drain the will to live.",
        "impulse": "To share her unending sorrow.",
        "harm_capacity": 8,
        "tags": [
          "Undead",
          "Incorporeal",
          "Terrifying"
        ],
        "gm_moves": [
          "Unleash a wail of despair, overwhelming the senses and hearts of all who hear it.",
          "Pass through a wall or character.",
          "Touch a character with chilling sorrow, draining their will."
        ]
      },
      {
        "name": "Basilisk",
        "description": "A reptilian beast whose gaze can turn living flesh to stone.",
        "impulse": "To hunt and add to its stone garden.",
        "harm_capacity": 7,
        "tags": [
          "Monstrosity",
          "Petrifying"
        ],
        "gm_moves": [
          "Lock its gaze on a target, beginning the petrification process.",
          "Deliver a powerful, crushing bite."
        ]
      },
      {
        "name": "Crystal Entity",
        "description": "A being of living crystal animated by the power of the Crystal Spire. It reflects magical energy.",
        "impulse": "To absorb and refract arcane energy.",
        "harm_capacity": 7,
        "tags": [
          "Elemental",
          "Magical",
          "Armored"
        ],
        "gm_moves": [
          "Reflect a spell back at its caster.",
          "Unleash a focused beam of stored energy.",
          "Shatter a crystalline limb, creating a field of sharp hazards."
        ]
      },
      {
        "name": "Dominion Sorcerer",
        "description": "An accomplished mage of the Arcane Dominion, wielding powerful and destructive elemental spells.",
        "impulse": "To demonstrate arcane superiority.",
        "harm_capacity": 6,
        "tags": [
          "Humanoid",
          "Magical",
          "Ranged"
        ],
        "gm_moves": [
          "Unleash a bolt of chain lightning that arcs between targets.",
          "Create a barrier of magical force.",
          "Teleport to a more advantageous position."
        ]
      },
      {
        "name": "Iron Golem",
        "description": "An upgraded golem forged from iron, nearly impervious to conventional weapons.",
        "impulse": "To obey its master's commands without question.",
        "harm_capacity": 10,
        "tags": [
          "Construct",
          "Armored",
          "Large",
          "Magic-Resistant"
        ],
        "gm_moves": [
          "Deliver a crushing iron fist blow.",
          "Ignore a magical effect through sheer force of will.",
          "Create a deafening, metallic roar."
        ]
      },
      {
        "name": "Mimic",
        "description": "A cunning predator that disguises itself as a treasure chest, lashing out at greedy adventurers.",
        "impulse": "To lure and consume the unwary.",
        "harm_capacity": 6,
        "tags": [
          "Aberration",
          "Ambusher",
          "Amorphous"
        ],
        "gm_moves": [
          "Reveal its true form in a surprise attack.",
          "Adhere to a character's weapon or body.",
          "Change its shape to escape or block a path."
        ]
      },
      {
        "name": "Minotaur",
        "description": "A bull-headed humanoid of immense strength, often found in labyrinths.",
        "impulse": "To stalk and overpower its prey.",
        "harm_capacity": 8,
        "tags": [
          "Monstrosity",
          "Brute",
          "Large"
        ],
        "gm_moves": [
          "Gore a target with its horns after a powerful charge.",
          "Swing a massive greataxe.",
          "Let out a bestial roar of frustration."
        ]
      },
      {
        "name": "Nightmare",
        "description": "A terrifying horse-like creature with a mane of shadow and hooves of burning embers.",
        "impulse": "To spread fear and fire.",
        "harm_capacity": 7,
        "tags": [
          "Fiend",
          "Fire",
          "Fast"
        ],
        "gm_moves": [
          "Charge forward, leaving a trail of fire in its wake.",
          "Exhale a cloud of choking smoke.",
          "Disappear into the shadows, only to reappear elsewhere."
        ]
      },
      {
        "name": "Ogre",
        "description": "A large, brutish giant that is dim-witted but incredibly strong.",
        "impulse": "To smash things.",
        "harm_capacity": 8,
        "tags": [
          "Giant",
          "Brute",
          "Large"
        ],
        "gm_moves": [
          "Swing a greatclub with devastating force.",
          "Throw a rock or another smaller creature.",
          "Fly into a rage when wounded."
        ]
      },
      {
        "name": "Order Knight",
        "description": "A disciplined warrior of the Champions of Order, clad in steel plate armor.",
        "impulse": "To enforce Elysia's will.",
        "harm_capacity": 6,
        "tags": [
          "Humanoid",
          "Armored",
          "Soldier"
        ],
        "gm_moves": [
          "Attack with a greatsword.",
          "Use a shield to daze a target.",
          "Form a defensive shield wall with other knights."
        ]
      },
      {
        "name": "Saberclaw Tiger",
        "description": "A prehistoric tiger with immense fangs, a patient and deadly predator.",
        "impulse": "To stalk and ambush its prey.",
        "harm_capacity": 6,
        "tags": [
          "Beast",
          "Ambusher",
          "Fast"
        ],
        "gm_moves": [
          "Pounce from hiding with advantage.",
          "Deliver a deep, bleeding bite with its fangs.",
          "Drag a smaller target away."
        ]
      },
      {
        "name": "Runic Sentinel",
        "description": "A bipedal, armored automaton of bronze and iron, with a single, glowing eye of pulsing arcane crystal. Its body is covered in ancient, glowing runes that flicker with power. Its movements are slow and deliberate, but each step shakes the ground with immense weight.",
        "impulse": "To protect the vaults from all intruders.",
        "harm_capacity": 10,
        "tags": [
          "Construct",
          "Armored (+2)",
          "Magical",
          "Large",
          "Slow"
        ],
        "gm_moves": [
          "Deliver a crushing, two-handed slam with its forelegs.",
          "When it takes harm: The runes on its body flare, releasing a burst of arcane energy that deals 1-harm (ap) to everyone nearby.",
          "Let out a deafening, metallic roar that stuns and disorients opponents.",
          "Slam its forelegs into the ground, creating a localized tremor that puts all nearby characters in a bad spot."
        ]
      },
      {
        "name": "Bio-Mutant",
        "description": "A twisted, hulking creature from Magister Vorlag's experiments. Its flesh is a patchwork of muscle and bone, and a sickly green energy pulses from its core. Its movements are erratic and violent, and it seems to be in a constant state of agonizing transformation.",
        "impulse": "To lash out in a confused, pain-fueled frenzy.",
        "harm_capacity": 8,
        "tags": [
          "Monstrosity",
          "Volatile",
          "Corrupted",
          "Regenerating"
        ],
        "gm_moves": [
          "Lash out with a powerful, unpredictable strike.",
          "When harmed: Release a cloud of corrosive spores that deal 1-harm to everyone nearby.",
          "Mutate a limb, gaining a new, temporary ability (e.g., a massive, armored claw).",
          "Absorb a nearby magical effect, causing it to go into an uncontrollable rage."
        ]
      },
      {
        "name": "Tide Guardian",
        "description": "An ancient, living sculpture of water, kelp, and polished stone. It is a serpentine creature of immense size with a flowing, multi-tentacled body. It is a non-hostile, but challenging, guardian of a key location, driven only by its sacred duty to protect the city's heart.",
        "impulse": "To guard its location from intruders, but not to kill.",
        "harm_capacity": 15,
        "tags": [
          "Elemental",
          "Aquatic",
          "Large",
          "Magical"
        ],
        "gm_moves": [
          "Create a powerful tidal current that pushes a target back.",
          "Ensnare a character in a tangle of living kelp.",
          "Unleash a geyser of water to create a screen of mist, providing cover for its allies.",
          "Heal itself by absorbing water from the surrounding environment."
        ]
      },
      {
        "name": "Coral Revenant",
        "description": "The spirit of a corrupted Astoran, bound to a skeleton of razor-sharp, luminescent coral. It moves with an unnatural, chilling silence, and its touch feels like the crushing pressure of the deep ocean. Its eyes are twin points of cold, malevolent light.",
        "impulse": "To protect its territory and drain the life from the living.",
        "harm_capacity": 7,
        "tags": [
          "Undead",
          "Incorporeal",
          "Magical",
          "Chilling"
        ],
        "gm_moves": [
          "Strike with a chilling touch that deals necrotic harm.",
          "Pass through a wall or character, reappearing in a new location.",
          "Unleash a mournful wail that disorients and terrifies opponents.",
          "Summon a small coral golem to fight alongside it."
        ]
      },
      {
        "name": "Blighted Elemental",
        "description": "A monstrous plant creature, formed from a twisted fusion of a treant and Magister Vorlag's magic. Its body is a grotesque amalgamation of thorny vines, fungus, and weeping, black sap. It is a force of pure corruption, driven to spread its blight wherever it goes.",
        "impulse": "To corrupt and ensnare.",
        "harm_capacity": 9,
        "tags": [
          "Plant",
          "Large",
          "Corrupted",
          "Magical",
          "Forceful"
        ],
        "gm_moves": [
          "Lash out with massive, thorny vines to ensnare a character.",
          "Spit a glob of black sap that spreads corruption and creates a hazardous zone.",
          "When harmed: Release a cloud of blight spores that deal ongoing harm to everyone nearby.",
          "Slam its body into a target, dealing immense physical harm."
        ]
      },
      {
        "name": "The Black Fin",
        "description": "A ruthless, high-level assassin who operates in Port Myria's waterways. She is a master of water magic and stealth, and her true face is always concealed beneath a dark leather mask. She is swift, deadly, and leaves no witnesses.",
        "impulse": "To eliminate her target with swift, silent efficiency.",
        "harm_capacity": 8,
        "tags": [
          "Humanoid",
          "Magical",
          "Stealthy",
          "Assassin"
        ],
        "gm_moves": [
          "Strike with a pair of poisoned daggers.",
          "Submerge herself in the water and disappear from sight, only to reappear behind her target.",
          "Unleash a high-pressure jet of water that pushes a target off-balance.",
          "Leave a trail of slick, oily water that creates a hazardous zone for everyone."
        ]
      }
    ],
    "tier_11_20": [
      {
        "name": "Cinder-Scale Tyrant",
        "description": "A massive, four-legged drake whose scales are made of cooling magma and obsidian. It guards the inner sanctum of the temple on Mount Dragnor.",
        "impulse": "To guard its lair with overwhelming fire.",
        "harm_capacity": 15,
        "tags": [
          "Dragonkin",
          "Large",
          "Fire",
          "Armored"
        ],
        "gm_moves": [
          "Breathe a cone of magma.",
          "Sweep its tail, knocking everyone nearby prone.",
          "Cause a volcanic fissure to erupt on the battlefield."
        ]
      },
      {
        "name": "Elder Treant",
        "description": "An ancient, walking tree of immense size and wisdom, a guardian of the forest.",
        "impulse": "To protect the ancient woods.",
        "harm_capacity": 12,
        "tags": [
          "Plant",
          "Large",
          "Magical"
        ],
        "gm_moves": [
          "Deliver a colossal slam with its branches.",
          "Animate nearby trees to fight alongside it.",
          "Entangle foes in living roots."
        ]
      },
      {
        "name": "Hydra",
        "description": "A multi-headed serpent. For each head that is severed, two more may grow in its place.",
        "impulse": "To devour and multiply.",
        "harm_capacity": 14,
        "tags": [
          "Monstrosity",
          "Large",
          "Regenerating"
        ],
        "gm_moves": [
          "Attack with multiple heads at once.",
          "Regrow a severed head, unless the wound is cauterized.",
          "Unleash a confusing cacophony of hisses."
        ]
      },
      {
        "name": "Kraken Spawn",
        "description": "A juvenile kraken, though still massive and deadly, with powerful tentacles.",
        "impulse": "To drag ships and sailors to the depths.",
        "harm_capacity": 16,
        "tags": [
          "Aberration",
          "Large",
          "Aquatic"
        ],
        "gm_moves": [
          "Slam the battlefield with multiple tentacles.",
          "Release a cloud of ink to blind and disorient.",
          "Grapple and crush a target."
        ]
      },
      {
        "name": "Lich",
        "description": "A powerful wizard who has achieved a form of immortality through undeath. Commands legions of lesser undead.",
        "impulse": "To accumulate power and knowledge, unhindered by mortality.",
        "harm_capacity": 12,
        "tags": [
          "Undead",
          "Magical",
          "Intelligent"
        ],
        "gm_moves": [
          "Cast a devastating spell like Frost Lance.",
          "Animate the dead to serve as minions.",
          "Paralyze a character with a touch."
        ]
      }
    ],
    "tier_21_plus": [
      {
        "name": "Ancient Gold Dragon",
        "description": "One of the last of the noble, elder dragons. A being of immense wisdom and power, whose scales shimmer like a thousand sunsets.",
        "impulse": "To protect the balance of the world.",
        "harm_capacity": 30,
        "tags": [
          "Dragonkin",
          "Large",
          "Magical",
          "Flying",
          "Legendary"
        ],
        "gm_moves": [
          "Unleash a breath of divine fire.",
          "Attack with overwhelming physical might (claws and bite).",
          "Alter the battlefield with ancient magic."
        ]
      },
      {
        "name": "Archon of Order",
        "description": "A celestial being of pure law, summoned to enforce Elysia's will. It is a being of living light and unyielding dogma.",
        "impulse": "To purge all forms of chaos.",
        "harm_capacity": 25,
        "tags": [
          "Celestial",
          "Flying",
          "Magical",
          "Lawful"
        ],
        "gm_moves": [
          "Strike with a lance of pure light.",
          "Issue a divine judgment, silencing a character's abilities.",
          "Create an aura of absolute order, hindering chaotic actions."
        ]
      },
      {
        "name": "Baron",
        "description": "A high-ranking demon lord, a fiend of immense power and cruelty.",
        "impulse": "To dominate and corrupt.",
        "harm_capacity": 28,
        "tags": [
          "Fiend",
          "Large",
          "Fire",
          "Magical",
          "Legendary"
        ],
        "gm_moves": [
          "Wield a greatsword of pure hellfire.",
          "Summon lesser demons to its aid.",
          "Create a raging inferno on the battlefield."
        ]
      },
      {
        "name": "Cathedral Gargoyle",
        "description": "A massive stone gargoyle animated by holy magic to protect the Elysian Grand Cathedral.",
        "impulse": "To serve as an eternal guardian.",
        "harm_capacity": 26,
        "tags": [
          "Construct",
          "Large",
          "Flying",
          "Holy"
        ],
        "gm_moves": [
          "Attack with claws of sanctified stone.",
          "Turn to stone to become nearly invulnerable.",
          "Heal itself in the presence of bright light."
        ]
      },
      {
        "name": "Dread Worm",
        "description": "An even more colossal version of the Sand Worm, ancient and intelligent.",
        "impulse": "To consume all life in its desert domain.",
        "harm_capacity": 32,
        "tags": [
          "Beast",
          "Large",
          "Burrowing",
          "Legendary"
        ],
        "gm_moves": [
          "Swallow a character whole, trapping them in its gullet.",
          "Cause an earthquake by burrowing beneath the party.",
          "Spit corrosive acid."
        ]
      },
      {
        "name": "Titan",
        "description": "One of the elder giants, a being of immense size and strength that can shatter mountains.",
        "impulse": "To slumber, and to crush those who disturb it.",
        "harm_capacity": 35,
        "tags": [
          "Giant",
          "Large",
          "Legendary"
        ],
        "gm_moves": [
          "Throw a colossal boulder.",
          "Create an earthquake by stomping its foot.",
          "Deliver a single, earth-shattering blow."
        ]
      },
      {
        "name": "Void Behemoth",
        "description": "A creature from the Void, a being of pure chaos and entropy.",
        "impulse": "To unmake reality.",
        "harm_capacity": 28,
        "tags": [
          "Aberration",
          "Large",
          "Chaotic"
        ],
        "gm_moves": [
          "Strike with chaotic energy, dealing random elemental damage.",
          "Drain a character's Legacy Points.",
          "Temporarily erase a section of the battlefield."
        ]
      }
    ],
    "bosses": [
      {
        "name": "Blightoad",
        "description": "A horrifically bloated toad-fiend, roughly the size of a small cart. Its slick, warty hide pulses with a sickly green light, and foul-smelling pustules weep a constant, black bile.",
        "impulse": "To consume and corrupt.",
        "harm_capacity": 9,
        "tags": [
          "Fiend",
          "Large",
          "Poisonous",
          "Boss"
        ],
        "gm_moves": [
          "Slam its body into a target.",
          "Spit corrosive bile.",
          "Lash out with a barbed tongue, pulling a character closer.",
          "Burst its pustules when struck, damaging nearby attackers."
        ]
      },
      {
        "name": "The Gloomwood Heart",
        "description": "An ancient treant that was once the guardian of the woods, now twisted by a creeping blight. Its wooden body is covered in pulsating fungi and weeping sap, and its movements are unnaturally violent.",
        "impulse": "To spread its corruption.",
        "harm_capacity": 12,
        "tags": [
          "Plant",
          "Large",
          "Corrupted",
          "Boss"
        ],
        "gm_moves": [
          "Strike with a crushing branch.",
          "Release a cloud of blight spores that damage over time.",
          "Summon corrupted saplings to its aid."
        ]
      },
      {
        "name": "Grand Inquisitor Valerius",
        "description": "A relentless and high-ranking member of the Champions of Order. Clad in blessed silver armor, he views draconic power not as a tool, but as a chaotic sin that must be purged from the world.",
        "impulse": "To capture Rya and impose perfect order.",
        "harm_capacity": 11,
        "tags": [
          "Humanoid",
          "Armored",
          "Holy",
          "Boss"
        ],
        "gm_moves": [
          "Attack with a consecrated blade that is anathema to dragons.",
          "Call down Elysian Judgment, silencing a character's power.",
          "Erect a Shield of Order, becoming temporarily immune to chaotic and draconic magic."
        ]
      },
      {
        "name": "Grove Warden",
        "description": "Once a serene, ancient guardian of the wood, this colossal treant has been driven to madness. Its bark is blackened and cracked, weeping a foul, dark sap.",
        "impulse": "To protect its grove through mindless rage.",
        "harm_capacity": 14,
        "tags": [
          "Plant",
          "Large",
          "Armored",
          "Boss"
        ],
        "gm_moves": [
          "Deliver a crushing branch attack.",
          "Unleash a sorrowful wail that weakens the party.",
          "Entangle the party in grasping roots.",
          "When bloodied: Enter a Rampaging Fury, increasing its damage and defenses."
        ]
      },
      {
        "name": "Runeforge Guardian",
        "description": "A bipedal construct of obsidian and brass, standing eight feet tall. Glowing runes pulse across its chassis, and its head is a single, unblinking crystalline lens.",
        "impulse": "To eliminate all intruders.",
        "harm_capacity": 0,
        "tags": [
          "Construct",
          "Armored",
          "Magical",
          "Adaptive",
          "Boss"
        ],
        "gm_moves": [
          "Attack with a Siege Fist or an Arcane Bolt.",
          "Trap a character in a cage of solid light.",
          "When bloodied: Go into an Overload Sequence, dealing damage to all nearby creatures each turn."
        ]
      },
      {
        "name": "Elysia, the Silent Goddess",
        "description": "The final antagonist, a being of pure, conceptual energy who seeks to 'correct' the heroes by erasing their free will.",
        "impulse": "To impose perfect, silent, unthinking order.",
        "harm_capacity": 50,
        "tags": [
          "Celestial",
          "Conceptual",
          "Lawful",
          "Legendary",
          "Boss"
        ],
        "gm_moves": [
          "Issue a Decree of Inertia, halting all movement.",
          "Issue a Decree of Silence, nullifying all magic and abilities.",
          "Issue a Decree of Entropy, attempting to unmake a character from existence.",
          "Warp reality, ignoring the rules of chance and consequence."
        ]
      },
      {
        "name": "The Dragon Lord",
        "description": "The resurrected and empowered spirit of the greatest of the ancient dragon kings.",
        "impulse": "To reclaim his throne and unleash a new age of dragons.",
        "harm_capacity": 40,
        "tags": [
          "Dragonkin",
          "Large",
          "Magical",
          "Flying",
          "Legendary",
          "Boss"
        ],
        "gm_moves": [
          "Unleash a breath of overwhelming, primal energy.",
          "Issue a Dragon's Decree, using the most powerful draconic abilities.",
          "Radiate a King's Aura, inspiring all draconic beings and demoralizing others."
        ]
      },
      {
        "name": "The Firstborn of the Void",
        "description": "A colossal entity of mouths, eyes, and tentacles that guards the very heart of the Void Chasm.",
        "impulse": "To consume reality and drive mortals to madness.",
        "harm_capacity": 35,
        "tags": [
          "Fiend",
          "Large",
          "Chaotic",
          "Terrifying",
          "Legendary",
          "Boss"
        ],
        "gm_moves": [
          "Gaze into a character's mind, inflicting permanent madness.",
          "Attack with a swarm of crushing tentacles.",
          "Unravel a piece of the battlefield, turning it into pure void."
        ]
      },
      {
        "name": "The Twin Wardens of the Pinnacle",
        "description": "Two colossal golems guarding Elysia's domain. One absorbs physical, the other magical damage.",
        "impulse": "To act as an impassable, twofold wall.",
        "harm_capacity": 20,
        "tags": [
          "Construct",
          "Large",
          "Magical",
          "Legendary",
          "Boss",
          "Paired"
        ],
        "gm_moves": [
          "(Warden of Form) Deliver an annihilating physical blow.",
          "(Warden of Thought) Unleash a devastating psionic blast.",
          "Share damage with its twin if the wrong damage type is used."
        ]
      },
      {
        "name": "The Unfettered, Awakened Zael",
        "description": "Zael, having fully succumbed to the Void and achieved a dark apotheosis.",
        "impulse": "To share the perfect, silent peace of the Void with his friends.",
        "harm_capacity": 45,
        "tags": [
          "Aberration",
          "Chaotic",
          "Legendary",
          "Boss"
        ],
        "gm_moves": [
          "Whisper words of despair, causing the party to lose their resolve.",
          "Gaze into a character's soul, draining their power and vitality.",
          "Summon a lesser horror from the Void to aid him."
        ]
      },
      {
        "name": "Kilgore, the Cinder-Clad",
        "description": "A massive, heavily armored warrior who has been granted a sliver of draconic power through the Brood's dark rituals. His armor is fused to his flesh, and his eyes glow with a malevolent, fiery light. He is the unstoppable will of the Ashen Priest made manifest.",
        "impulse": "To serve the Ashen Priest as an instrument of pure, unthinking destruction.",
        "harm_capacity": 15,
        "tags": [
          "Humanoid",
          "Armored",
          "Magical",
          "Fire",
          "Brute",
          "Boss"
        ],
        "gm_moves": [
          "Deliver a colossal, fiery slam, dealing massive harm.",
          "Create a wall of fire with his sword, reshaping the battlefield and providing cover.",
          "When bloodied: He enters a furious rage, attacking with blind, unthinking ferocity."
        ]
      },
      {
        "name": "The Ashen Priest",
        "description": "The charismatic and fanatical leader of the Brood of Dragnor. His face is hidden behind a mask of obsidian, and his robes are perpetually covered in a fine layer of volcanic ash. He preaches a doctrine of nihilistic destruction, believing that the world must be cleansed in fire to pave the way for a new age of dragons.",
        "impulse": "To bring about a fiery apocalypse and a new age of draconic rule.",
        "harm_capacity": 12,
        "tags": [
          "Humanoid",
          "Magical",
          "Ritualist",
          "Boss"
        ],
        "gm_moves": [
          "Incite a crowd of followers to a religious frenzy.",
          "Perform a dark ritual to awaken a fire-based monster.",
          "Unleash a devastating, area-of-effect fire spell.",
          "Offer a character a taste of draconic power in exchange for their loyalty."
        ]
      },
      {
        "name": "Resonance Warden",
        "description": "A pre-Shattering guardian that floats silently in the center of a key junction or chamber. It is a complex, geometric lattice of humming crystal and polished brass, about the size of a carriage. It has no visible weapons, and its surface ripples with shifting patterns of light.",
        "impulse": "To pacify intruders through sensory overload.",
        "harm_capacity": 12,
        "tags": [
          "Construct",
          "Magical",
          "Sonic",
          "Luminous",
          "Puzzle"
        ],
        "special_rule": "Harmonic Shielding: The Resonance Warden is immune to all direct harm. To defeat it, the party must first destroy the three 'Focusing Crystals' set into the walls of its chamber. Each crystal has a Harm Capacity of 4.",
        "gm_moves": [
          "Emit a high-frequency sonic pulse, forcing all characters to make a Force roll or be stunned for a moment.",
          "Unleash a disorienting strobe of light, forcing all characters to make a Finesse roll or be blinded for their next action.",
          "Channel energy into the Focusing Crystals, causing them to emit damaging beams of light.",
          "Create a resonant field that makes all verbal communication impossible for a short time."
        ]
      },
      {
        "name": "The Black Fin",
        "description": "A ruthless, high-level assassin who operates in Port Myria's waterways. She is a master of water magic and stealth, and her true face is always concealed beneath a dark leather mask. She is swift, deadly, and leaves no witnesses.",
        "impulse": "To eliminate her target with swift, silent efficiency.",
        "harm_capacity": 8,
        "tags": [
          "Humanoid",
          "Magical",
          "Stealthy",
          "Assassin"
        ],
        "gm_moves": [
          "Strike with a pair of poisoned daggers.",
          "Submerge herself in the water and disappear from sight, only to reappear behind her target.",
          "Unleash a high-pressure jet of water that pushes a target off-balance.",
          "Leave a trail of slick, oily water that creates a hazardous zone for everyone."
        ]
      }
    ]
  }
}
