{
  "playbook_name": "The Scrivener",
  "character_name": "Era",
  "char_id": "ASTORAN_ERA",
  "type": "Astoran",
  "description": "A young, curious Astoran chronicler whose bioluminescent scales shift with her emotions. She seeks to create a complete codex of the world's creatures by magically replicating their abilities.",
  "lore": {
    "background": "Era was a student of Loremaster Oris, tasked with chronicling Astoran history. Her curiosity led her to secretly document the abilities of living creatures, developing a unique magic that allowed her to replicate the skills she observed. Censured by her isolationist elders, she has ventured to the surface to prove that the world is a library, and every monster a book.",
    "narrative_hook": "Era's quest to document the world's creatures puts her at odds with factions who would rather see them exploited or exterminated, such as the Arcane Dominion. Her unique magical abilities may also attract unwanted attention from those who see her as a threat or a tool."
  },
  "attributes": { "Force": -1, "Finesse": 0, "Wits": "+2", "Heart": "+1" },
  "trained_skills": [ "Know", "Investigate", "Survey" ],
  "harm_capacity": 6,
  "starting_moves": [
    {
      "name": "Monster Codex (Core Mechanic)",
      "description": "You carry a special codex to record the essence of creatures you encounter. You can have a number of abilities transcribed in your codex equal to your Wits score + 3. During a rest, you can prepare a number of these abilities equal to your Wits score (minimum 1)."
    },
    {
      "name": "Transcribe Essence",
      "description": "When you witness a creature use a signature, non-ultimate ability, you can take a moment to understand and record it. Roll `2d6 + Wits`. On a **10+**, you perfectly capture its essence; add the ability to your codex. On a **7-9**, you capture it, but the transcription is flawed: it will be weaker, unstable, or require a strange component to use. On a **6-**, you fail to grasp it and the feedback leaves you mentally vulnerable until you can clear your head."
    },
    {
      "name": "Analyze Creature",
      "description": "When you carefully study a creature, roll `2d6 + Wits`. On a **10+**, ask the GM 3 questions about its capabilities, instincts, or weaknesses. On a **7-9**, ask 1. The GM will answer truthfully."
    }
  ],
  "advanced_moves": [
    {
      "name": "Mending Tide",
      "description": "You can channel the restorative power of the deep ocean. When you Tend to an ally, you can choose to mark 1 Harm yourself to suffuse your care with life-giving water. If you do, they heal an additional 1 Harm and are cleansed of one physical effect (like poison or sickness)."
    },
    {
      "name": "Tidal Pull",
      "description": "When you call upon your innate connection to the ocean to control the battlefield, roll 2d6 + Heart. On a 10+, you create a powerful riptide; choose two from the list below. On a 7-9, the tide is wild; choose one, but the GM will introduce a complication.\n- An enemy is pulled into a bad spot.\n- You or an ally are repositioned safely.\n- You create a zone of churning, difficult terrain."
    },
    {
      "name": "Abyssal Sight",
      "description": "You have learned the Astorani art of scrying. When you spend a few moments in quiet contemplation with a source of water, you can ask the GM one question about a person, place, or object. The GM will answer with a cryptic but truthful vision."
    },
    {
      "name": "Rapid Transcription",
      "description": "You can now use **Transcribe Essence** in the heat of the moment. When you do, on a 7-9, you must also expose yourself to danger."
    }
  ],
  "bond_synergy": {
    "name": "Draconic Scholar",
    "description": "Rya's draconic nature is a font of primal magic. When Era attempts to **Transcribe Essence** from any creature with Dragonkin or Elemental heritage, she may re-roll one of the dice. In return, when Rya uses Unleash Draconic Power against a creature Era has successfully used 'Analyze Creature' on, Rya's roll gains a +1 bonus."
  }
}
