{
  "playbook_name": "The Pack Leader",
  "character_name": "Kei",
  "char_id": "FROSTFANG_KEI",
  "type": "Frostfang (Wolf-like humanoid)",
  "description": "A proud and defiant scout, the rightful heir to his pack. Exiled by a usurper, he now fights to reclaim his honor and protect his new pack—the party.",
  "lore": {
    "background": "Kei was once considered an ideal heir to his pack's leadership in the frozen Glacial Maw, but a rival, Vargus, framed him for a crime against his people. In his lust for power, Vargus allied himself with the technologically advanced Arcane Dominion, an unforgivable betrayal. Exiled and hunted, Kei now travels with the party, his knowledge of the unforgiving tundra invaluable. His quest is to expose the conspiracy and reclaim his honor.",
    "narrative_hook": "Kei's rival actively uses Arcane Dominion agents to hunt the party, leading to ambushes and tense tracking sequences in the wild. Kei's knowledge of the tundra is essential for finding hidden ruins and navigating the treacherous Glacial Maw."
  },
  "attributes": { "Force": "+1", "Finesse": "+2", "Wits": 0, "Heart": -1 },
  "trained_skills": [ "Maneuver", "Prowl", "Survey" ],
  "harm_capacity": 7,
  "starting_moves": [
    {
      "name": "Pack Tactics (Passive)",
      "description": "When you and an ally are both in melee with the same foe, you deal +1 harm."
    },
    {
      "name": "Harrier's Strike",
      "description": "When you **Engage in Battle** to create an opening for an ally, roll `2d6 + Finesse`. On a **10+**, you deal your harm and your ally gets a clear shot; they take a +2 bonus on their next move against your target. On a **7-9**, you create the opening, but you overextend in the process, exposing yourself to danger."
    },
    {
      "name": "Warning Snarl",
      "description": "When an enemy is about to attack an ally, you can intercede. Roll `2d6 + Finesse`. On a **10+**, you intercept them flawlessly, and you get to act first. On a **7-9**, you intercept them, but you both stumble into a bad spot, with the enemy gaining the upper hand."
    }
  ],
  "advanced_moves": [
    {
      "name": "Hunter's Guile",
      "description": "You learned to survive alone in the unforgiving tundra. When you are in a natural environment (forest, snow, mountains), you can use the Prowl move even when only lightly obscured. When you attack from hiding using this move, you deal +1 harm."
    },
    {
      "name": "Ambush",
      "description": "When you attack an enemy who is completely unaware of your presence, roll 2d6 + Finesse. On a 10+, it's a perfect strike; you deal 3-harm (ap). On a 7-9, you still deal your harm +1, but your attack exposes your position."
    },
    {
      "name": "Hamstring",
      "description": "When you Engage in Battle and deal harm, you can choose to deal 1 less harm to also strike at your target's leg. Your target is slowed and put in a bad spot until they can take a moment to recover."
    },
    {
      "name": "Rallying Howl",
      "description": "When you raise your voice in a rallying cry for your pack, roll `2d6 + Force`. On a **10+**, you and your allies are bolstered by your leadership; you all clear 1 Harm. On a **7-9**, the howl rallies you, but also alerts every enemy in the area to your exact position."
    }
  ],
  "bond_synergy": {
    "name": "Alpha's Trust",
    "description": "Kei sees the strength of an Alpha in Rya. When Kei uses **Harrier's Strike** to set up an attack for Rya, Rya's subsequent move is automatically treated as a 10+."
  }
}
