{
  "playbook_name": "The Falconer",
  "character_name": "Talia",
  "char_id": "SKYVEIL_TALIA",
  "type": "Skyveil (Falcon-like humanoid)",
  "description": "A fiercely independent hunter with the sharp, predatory eyes of a falcon. She is on a personal quest for vengeance against the Arcane Dominion captain who left her for dead.",
  "lore": {
    "background": "Talia was born on the highest peak of the Serpent's Coil Mountains, home to the proud, independent Skyveil people. She left her isolationist home seeking adventure and to track down a notorious Arcane Dominion captain who shot her down and left her for dead. Her personal quest for vengeance is intertwined with the fate of the world. She is fiercely independent and loyal to those who earn her respect.",
    "narrative_hook": "Talia is on a personal quest to track down a notorious Arcane Dominion captain who shot her down and left her for dead. This captain is a recurring antagonist who holds a valuable relic the party needs."
  },
  "attributes": { "Force": 0, "Finesse": "+2", "Wits": "+1", "Heart": -1 },
  "trained_skills": [ "Maneuver", "Survey", "Prowl" ],
  "harm_capacity": 6,
  "starting_moves": [
    {
      "name": "Called Shot",
      "description": "When you take a moment to line up the perfect shot at an unsuspecting or vulnerable target, roll `2d6 + Finesse`. On a **10+**, you hit a weak point; deal your harm and choose one from the list below. On a **7-9**, you still hit, but you must either move to a less advantageous position to get the shot or expose yourself to danger."
    },
    {
      "name": "Hunter's Mark",
      "description": "When you focus on a single enemy, you can mark them as your prey. When you deal harm to your prey, you deal +1 harm."
    },
    {
      "name": "Wind-Rider",
      "description": "When you use your wings to gain a tactical advantage, roll `2d6 + Finesse`. On a **10+**, you soar to a perfect vantage point, gaining a clear shot at any target. Ranged attacks against you have a -2 penalty until you move. On a **7-9**, you get into the air, but the flight is clumsy, drawing unwanted attention or leaving you exposed."
    }
  ],
  "called_shot_options": [
    "The shot bypasses their armor completely.",
    "You pin them to a surface, immobilizing them.",
    "You disarm them, forcing them to drop one held item."
  ],
  "advanced_moves": [
    {
      "name": "Eagle Eye",
      "description": "You can make a **Called Shot** from an extreme distance, far beyond a normal bow's range."
    },
    {
      "name": "Hail of Arrows",
      "description": "When you fire a volley of arrows to suppress an area, roll `2d6 + Finesse`. On a **10+**, you deal your harm to all enemies in a wide area. On a **7-9**, you still deal harm, but you may also hit one of your allies in the chaos."
    },
    {
      "name": "Vengeful Heart",
      "description": "Your **Hunter's Mark** now deals +2 harm instead of +1 when used against any agent of the Arcane Dominion."
    }
  ],
  "bond_synergy": {
    "name": "Death From Above",
    "description": "When Talia uses **Wind-Rider** while Rya is in a Draconic Manifestation, Rya's power can create a powerful updraft for her. Talia's roll is automatically a 10+, and she can make a free **Called Shot** as soon as she reaches her vantage point. This coordinated aerial assault gives Rya a perfect view of the battlefield; Rya takes +1 forward on her next action."
  }
}
